# методы


friends='Максим Леонид'
print (friends)

# посмотреть какой длины наша строка.Функция
print (len(friends))

# найти подстроку в строке. Метод
print (friends.find('Лео'))

# метод разбивает строку на части через пробел
print (friends.split())

# метод проверяет состоит ли строка только из цифр
print (friends.isdigit())

# метод делает все буквы большими
print (friends.upper())

# метод делает все буквы в строке маленькими
print (friends.lower())

# с помощью функции help можно посмотреть другие методы